# 제어문
# for문을 여러가지 데이터를 순차적으로 다루게 해준다.

stockList = ["태웅로직스", "코오롱글로벌", "제노포커스", "부산주공", "한국팩키지"];

for stockName in stockList :
    print("종목명 : %s" % stockName);
    
for stockName in stockList :
    break;
    print("브레이크 이후의 종목명 : %s" % stockName);

stockDict = {"삼성전자":{"일시":20200603, "시가":51800, "고가":55000, "저가":51700, "종가":54500, "대비":3100, "대비율":6.03, "거래량":49257814, "거래대금":2655435}
, "LG화학":{"일시":20200603, "시가":399000, "고가":401500, "저가":395000, "종가":400500, "대비":5500, "대비율":1.39, "거래량":474692, "거래대금":189208}, "카카오":{"일시":20200603, "시가":259500, "고가":261500, "저가":247500, "종가":249500, "대비":-10000, "대비율":-3.85, "거래량":2302391, "거래대금":579420}
, "원풍물산":{"일시":20200603, "시가":2740, "고가":2740, "저가":2660, "종가":2685, "대비":-35, "대비율":-1.29, "거래량":189652, "거래대금":508}, "싸이토젠":{"일시":20200603, "시가":11750, "고가":12800, "저가":11450, "종가":11850, "대비":250, "대비율":2.16, "거래량":523838, "거래대금":6315}
,"현대차":{"일시":20200603, "시가":106000, "고가":110000, "저가":105500, "종가":108500, "대비":6000, "대비율":5.85, "거래량":3118795, "거래대금":335572}
, "한익스프레스":{"일시":20200603, "시가":4880, "고가":4925, "저가":4785, "종가":4800, "대비":-65, "대비율":-1.34, "거래량":119770, "거래대금":579}
, "한국팩키지":{"일시":20200603, "시가":2445, "고가":2450, "저가":2385, "종가":2385, "대비":-45, "대비율":-1.85, "거래량":287030, "거래대금":690}
, "대림제지":{"일시":20200603, "시가":1670, "고가":1670, "저가":1625, "종가":1630, "대비":-35, "대비율":-2.10, "거래량":513975, "거래대금":845}
, "아이에이":{"일시":20200603, "시가":502, "고가":520, "저가":495, "종가":510, "대비":8, "대비율":1.59, "거래량":2450376, "거래대금":1237}
};

for stockName in stockDict.keys() :
    end = stockDict[stockName]["종가"]
    if end > 10000 :
        print("조건 계산 통과, 종목 명 : %s, 종가 : %s" % (stockName, end));

for stockName in stockDict.keys() :
    end = stockDict[stockName]["종가"];
    if end > 10000 :
        continue;
    else :
        print("조건 계산 통과, 종목 명 : %s, 종가 : %s" % (stockName, end));
